# 1. Пользователь вводит три числа. Увеличьте первое число в два раза, 
# второе числа уменьшите на 3, 
# третье число возведите в квадрат и затем найдите сумму новых трех чисел.

num1 = int(input())
num2 = int(input())
num3 = int(input())


print((num1 * 2) + (num2 - 3) + (num3 ** 2))